// =======================================================
/*
 * 2015年度ソフトウェア工学実習: [Java例題] P0002-Event
 *                      2015-06-22
 *                      飯島 正 (iijima@ae.keio.ac.jp)
 * -------------------------------------------------------
 * P0002a-Event-20150622 iijima 2015-04-27に配布したものを再調整
 * -------------------------------------------------------
 */
// =======================================================
package ex05_key_event;
// =======================================================

import java.awt.BorderLayout;
import java.awt.Dimension;
import java.awt.Font;
import java.awt.event.KeyEvent;
import java.awt.event.KeyListener;
import javax.swing.JFrame;
import javax.swing.JPanel;
import javax.swing.JScrollPane;
import javax.swing.JTextArea;
import javax.swing.JTextField;

// =======================================================
// =======================================================
/**
 * [Java例題] P0002-Event: Keyイベント<br>
 *
 * @author 飯島 正 (iijima@ae.keio.ac.jp)
 * @version <br>
 * 2015-06-22 iijima 再調整: NetBeans Projectとして再配布 <br>
 * 2015-04-27 iijima 新規作成: プレインなJavaファイル+バッチファイルで配布 <br>
 */
// =======================================================
public class TestKeyEventFrame extends JFrame {
// =======================================================
    // ===================================================
    // ///////////////////////////////////////////////////
    // ///// フィールド変数 //////////////////////////////
    // ///////////////////////////////////////////////////
    // ===================================================
    // ///// GUI 部品 ////////////////////////////////////
    // ===================================================
    // パネルとフォント
    // ---------------------------------------------------

    /**
     * テスト用のパネル
     */
    // ---------------------------------------------------
    private JPanel aTestPanel = null;
    // ---------------------------------------------------
    /**
     * 結果表示用のパネル
     */
    // ---------------------------------------------------
    private JPanel aResultPanel = null;
    // ---------------------------------------------------
    /**
     * 結果表示用のテキストエリア
     */
    // ---------------------------------------------------
    private JTextArea aResultTextArea = null;
    // ---------------------------------------------------   

    /**
     * フォント
     */
    // ---------------------------------------------------
    private Font aFont = null;
    // ===================================================
    // Keyイベントを発生させるGUI部品

    // ---------------------------------------------------
    /**
     * テキストフィールド(Keyイベントを発生させる)
     */
    // ---------------------------------------------------
    private JTextField aTextField = null;

    // ===================================================
    // ===================================================
    // ///////////////////////////////////////////////////
    // ///// メソッド (コンストラクタ) ///////////////////
    // ///////////////////////////////////////////////////
    // ===================================================

    /**
     * 【コンストラクタ】 GUI部品の配置とイベントリスナーの登録
     */
    // ---------------------------------------------------
    public TestKeyEventFrame() {
        // -----------------------------------------------
        // (1) テスト用フレームの準備
        initializeTestFrame("Keyイベントのテスト");
        // -----------------------------------------------
        // (2) keyイベントを発効するGUI部品のパネルへの追加
        aTextField = new JTextField("ここでキー入力してください",40);
        aTextField.setFont(aFont);
        aTestPanel.add(aTextField);
        // -----------------------------------------------
        // (3) Mouseイベントのリスナー登録
        aTextField.addKeyListener(new TestKeyEventListener());
        // -----------------------------------------------
        // (4) GUI部品の調整
        pack();
        // -----------------------------------------------
    }
    // ===================================================
    /**
     * テスト用フレームの初期化
     * @param title タイトルバーの文字列
     */
    // ---------------------------------------------------
    private void initializeTestFrame(String title) {
        // -----------------------------------------------
        // (1) フレームの準備
        setTitle(title);
        setPreferredSize(new Dimension(600, 400));
        setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);
        // -----------------------------------------------
        // (2) パネルのレイアウトマネージャの準備
        setLayout(new BorderLayout());
        // -----------------------------------------------
        // (3) フォントの準備
        aFont = new Font("ＭＳ ゴシック", Font.PLAIN, 28);
        // -----------------------------------------------
        // (4) テスト用パネルの準備
        aTestPanel = new JPanel();
        add(aTestPanel, BorderLayout.CENTER);
        // -----------------------------------------------
        // (5) 結果表示用パネルの準備
        aResultTextArea = new JTextArea(5, 40);
        aResultTextArea.setFont(aFont);
        JScrollPane aScrollPane = new JScrollPane(aResultTextArea);
        aResultPanel = new JPanel();
        aResultPanel.add(aScrollPane);
        add(aResultPanel, BorderLayout.SOUTH);
        // -----------------------------------------------
    }

    // ===================================================
    // ///////////////////////////////////////////////////
    // ///// イベントハンドラー //////////////////////////
    // ///////////////////////////////////////////////////
    // ===================================================
    // ===================================================

    /**
     * イベントリスナー
     *
     * ※KeyListenerインタフェースを実装する代わりに<br>
     * ※KeyApapterクラスを継承することで，<br>
     * ※関心のあるハンドラーだけをオーバライドすることができる
     */
    // ---------------------------------------------------
    class TestKeyEventListener implements KeyListener {

        // -----------------------------------------------

        /**
         * キーtypeイベントのハンドラー
         *
         * @param e キーイベント
         */
        // -----------------------------------------------
        public void keyTyped(KeyEvent e) {
            // -------------------------------------------
            String message = "キーがタイプされた: " + e.getKeyChar() + ":" + keyCode(e.getKeyCode());
            outputResult( message );
            // -------------------------------------------
        }

        // -----------------------------------------------

        /**
         * キーpressイベントのハンドラー
         *
         * @param e キーイベント
         */
        // -----------------------------------------------
        public void keyPressed(KeyEvent e) {
            // -------------------------------------------
            String message = "キーが押された: " + e.getKeyChar() + "　　:" + keyCode(e.getKeyCode());
            outputResult( message );
            // -------------------------------------------
        }

        // -----------------------------------------------

        /**
         * キーreleaseイベントのハンドラー
         *
         * @param e キーイベント
         */
        // -----------------------------------------------
        public void keyReleased(KeyEvent e) {
            // -------------------------------------------
            String message = "キーが離された: " + e.getKeyChar() + "　　:" + keyCode(e.getKeyCode());
            outputResult( message );
            // -------------------------------------------
        }

        // -----------------------------------------------

        /**
         * キーcodeの表示文字列を返す
         *
         * @param code キーコード
         * @return 表示文字列
         */
        // -----------------------------------------------
        private String keyCode(int code) {
            // -------------------------------------------
            if (code >= KeyEvent.VK_0 && code <= KeyEvent.VK_9) {
                return ("数字");
            } else if (code >= KeyEvent.VK_A && code <= KeyEvent.VK_Z) {
                return ("アルファベット");
            } else if (code >= KeyEvent.VK_F1 && code <= KeyEvent.VK_F12) {
                return ("ファンクションキーF" + (code - KeyEvent.VK_F1 + 1));
            } else {
                switch (code) {
                    case KeyEvent.VK_UP:
                        return ("矢印キーの上");
                    case KeyEvent.VK_DOWN:
                        return ("矢印キーの下");
                    case KeyEvent.VK_RIGHT:
                        return ("矢印キーの右");
                    case KeyEvent.VK_LEFT:
                        return ("矢印キーの左");
                    case KeyEvent.VK_ENTER:
                        return ("ENTERキー");
                    case KeyEvent.VK_SHIFT:
                        return ("SHIFTキー");
                    case KeyEvent.VK_ALT:
                        return ("ALTキー");
                    case KeyEvent.VK_CONTROL:
                        return ("CONTROLキー");
                    default:
                        return ("");
                }
            }
            // -------------------------------------------
        }
        // ===============================================
        /**
         * 結果表示
         * @param message 表示する結果
         */
        // -----------------------------------------------        
        private void outputResult( String message ) {
            // -------------------------------------------
            System.out.println(message);
            aResultTextArea.append(message + "\n");
            // -------------------------------------------
        }
        // ===============================================
    }
    // ===================================================
}
// =======================================================
