// =======================================================
// ソフトウェア工学実習 iijima@ae.keio.ac.jp
// =======================================================
package p0104;
// =======================================================
import javax.swing.*;
import java.awt.*;
import java.awt.event.*;
// =======================================================
/**
 * ソフトウェア工学実習
 * @author iijima@ae.keio.ac.jp
 */
// =======================================================
class LikeButton extends JButton implements ActionListener {
    // ===================================================
    /** カウンタ */
    // ===================================================
    private int count = 0;
    // ===================================================
    /** カウントを表示するラベル */
    // ===================================================
    private JLabel aLabel;
    // ===================================================
	/**
     * コンストラクタ(インスタンス生成時の初期設定をします)
     */
	// ===================================================
    public LikeButton( JLabel aLabel ) {
		super( "いいね" );
		addActionListener(this);
		this.aLabel = aLabel;
	}
	// ===================================================
	/**
     * イベント・ハンドラ(ActionEvent)
     */
	// ===================================================
	public void actionPerformed( ActionEvent e ){
        // カウントアップし，その値をラベルに表示する
		count++;
		aLabel.setText( Integer.toString( count ) );
	}
	// ===================================================
}
// =======================================================
