// =======================================================
/*
 * 2015年度ソフトウェア工学実習: [Java例題] P0002-Event
 *                      2015-06-22
 *                      飯島 正 (iijima@ae.keio.ac.jp)
 * -------------------------------------------------------
 * P0002a-Event-20150622 iijima 2015-04-27に配布したものを再調整
 * -------------------------------------------------------
 */
// =======================================================
package ex06_document_event;
// =======================================================

import java.awt.BorderLayout;
import java.awt.Dimension;
import java.awt.Font;
import javax.swing.JFrame;
import javax.swing.JPanel;
import javax.swing.JScrollPane;
import javax.swing.JTextArea;
import javax.swing.event.DocumentEvent;
import javax.swing.event.DocumentListener;
import javax.swing.text.Document;


// =======================================================
// =======================================================

/**
 * [Java例題] P0002-Event: Documentイベント<br>
 *
 * @author 飯島 正 (iijima@ae.keio.ac.jp)
 * @version <br>
 * 2015-06-22 iijima 再調整: NetBeans Projectとして再配布 <br>
 * 2015-04-27 iijima 新規作成: プレインなJavaファイル+バッチファイルで配布 <br>
 */
// =======================================================
public class TestDocumentEventFrame extends JFrame {
// =======================================================
    // ===================================================
    // ///////////////////////////////////////////////////
    // ///// フィールド変数 //////////////////////////////
    // ///////////////////////////////////////////////////
    // ===================================================
    // ///// GUI 部品 ////////////////////////////////////
    // ===================================================
    // パネルとフォント
    // ---------------------------------------------------

    /**
     * テスト用のパネル
     */
    // ---------------------------------------------------
    private JPanel aTestPanel = null;
    // ---------------------------------------------------
    /**
     * 結果表示用のパネル
     */
    // ---------------------------------------------------
    private JPanel aResultPanel = null;
    // ---------------------------------------------------
    /**
     * 結果表示用のテキストエリア
     */
    // ---------------------------------------------------
    private JTextArea aResultTextArea = null;
    // ---------------------------------------------------   

    /**
     * フォント
     */
    // ---------------------------------------------------
    private Font aFont = null;
    // ---------------------------------------------------
    // Documentイベントを発生させるGUI部品
    
    // ---------------------------------------------------
    /**
     * テキストエリア(Documentイベントを発生させる)
     */
    
    // ---------------------------------------------------
    private JTextArea aTextArea  = null;
    // ===================================================
    // ===================================================
    // ///////////////////////////////////////////////////
    // ///// メソッド (コンストラクタ) ///////////////////
    // ///////////////////////////////////////////////////
    // ===================================================
    /**
     * 【コンストラクタ】 GUI部品の配置とイベントリスナーの登録
     */
    // ---------------------------------------------------
    public TestDocumentEventFrame() {
        // -----------------------------------------------
        // (1) テスト用フレームの準備
        initializeTestFrame( "Documentイベントのテスト" );
        // -----------------------------------------------
        // (2) keyイベントを発効するGUI部品のパネルへの追加
        aTextArea = new JTextArea( "テキストフィールド" );
        aTextArea.setFont( aFont );
        aTestPanel.add( aTextArea );
        // -----------------------------------------------
        // (3) Textイベントのリスナー登録
       aTextArea.getDocument().addDocumentListener( 
                        new TestDocumentEventListener() );
        // -----------------------------------------------
        // (4) GUI部品の調整
        pack();
        // -----------------------------------------------
    }
    // ===================================================
    /**
     * テスト用フレームの初期化
     * @param title タイトルバーの文字列
     */
    // ---------------------------------------------------
    private void initializeTestFrame(String title) {
        // -----------------------------------------------
        // (1) フレームの準備
        setTitle(title);
        setPreferredSize(new Dimension(600, 400));
        setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);
        // -----------------------------------------------
        // (2) パネルのレイアウトマネージャの準備
        setLayout(new BorderLayout());
        // -----------------------------------------------
        // (3) フォントの準備
        aFont = new Font("ＭＳ ゴシック", Font.PLAIN, 28);
        // -----------------------------------------------
        // (4) テスト用パネルの準備
        aTestPanel = new JPanel();
        add(aTestPanel, BorderLayout.CENTER);
        // -----------------------------------------------
        // (5) 結果表示用パネルの準備
        aResultTextArea = new JTextArea(5, 40);
        aResultTextArea.setFont(aFont);
        JScrollPane aScrollPane = new JScrollPane(aResultTextArea);
        aResultPanel = new JPanel();
        aResultPanel.add(aScrollPane);
        add(aResultPanel, BorderLayout.SOUTH);
        // -----------------------------------------------
    }

    // ===================================================
    // ///////////////////////////////////////////////////
    // ///// イベントハンドラー //////////////////////////
    // ///////////////////////////////////////////////////
    // ===================================================
    // ===================================================
    /**
     * イベントリスナー
     * 
     * ※DocumentListenerインタフェースを実装する代わりに<br>
     * ※DocumentApapterクラスを継承することで，<br>
     * ※関心のあるハンドラーだけをオーバライドすることができる
     */
    // ---------------------------------------------------
    class TestDocumentEventListener implements DocumentListener {
        // -----------------------------------------------
        /**
         * ドキュメントchangeイベントのハンドラー
         * @param e ドキュメントイベント
         */
        // -----------------------------------------------
        public void changedUpdate( DocumentEvent e ) {
            // -------------------------------------------
            Document aDocument = e.getDocument();
            if ( aDocument == aTextArea.getDocument() ) {
                String message = "属性の変更";
                outputResult( message );
            }
            // -------------------------------------------
        }
        // -----------------------------------------------
        /**
         * ドキュメントinsertイベントのハンドラー
         * @param e ドキュメントイベント
         */
        // -----------------------------------------------
        public void insertUpdate( DocumentEvent e ) {
            // -------------------------------------------
            Document aDocument = e.getDocument();
            if ( aDocument == aTextArea.getDocument() ) {
                String message = "挿入";
                outputResult( message );
            }
            // -------------------------------------------
        }
        // -----------------------------------------------
        /**
         * ドキュメントremoveイベントのハンドラー
         * @param e ドキュメントイベント
         */
        // -----------------------------------------------
        public void removeUpdate( DocumentEvent e ) {
            // -------------------------------------------
            Document aDocument = e.getDocument();
            if ( aDocument == aTextArea.getDocument() ) {
                String message = "削除";
                outputResult( message );
            }
            // -------------------------------------------
        }
        // ===============================================
        /**
         * 結果表示
         * @param message 表示する結果
         */
        // -----------------------------------------------        
        private void outputResult( String message ) {
            // -------------------------------------------
            System.out.println(message);
            aResultTextArea.append(message + "\n");
            // -------------------------------------------
        }
        // ===============================================
    }
    // ===================================================
}
// =======================================================
