@rem =====================================================
@echo off
@rem =====================================================
@rem make 2013.04.12 iijima@ae.keio.ac.jp
@rem =====================================================
set SRC=src
set DST=classes
@rem =====================================================
title ソフトウェア工学実習: make %PACKAGE%.%TARGET%
echo  ソフトウェア工学実習: make %PACKAGE%.%TARGET%
@rem -----------------------------------------------------
if not exist %DST% (
    mkdir %DST%
)
@rem -----------------------------------------------------
javac -d %DST% -cp %DST% -sourcepath %SRC% %SRC%/%PACKAGE%/%TARGET%.java
@rem =====================================================