// =======================================================
// ソフトウェア工学実習 iijima@ae.keio.ac.jp
// =======================================================
package p0101;
// =======================================================
import javax.swing.*;
import java.awt.*;
// =======================================================
/**
 * ソフトウェア工学実習
 * @author iijima@ae.keio.ac.jp
 */
// =======================================================
public class FrameA extends JFrame {
    // ===================================================
    /**
     * コンストラクタ(インスタンス生成時の初期設定をします)
     */
    // ===================================================
    public FrameA() {
        // 終了方法の設定
        // (ウィンドウのクローズにアプリケーションを終了させる)
        setDefaultCloseOperation( JFrame.EXIT_ON_CLOSE );
        // GUI部品に適したウィンドウサイズに調整
        pack(); 
        // 位置と大きさの設定
        setBounds( 100, 200, 400, 300 );
    }
    // ===================================================
    /**
     * メイン・メソッド
     * @param args コマンド行引数
     */
    // ===================================================
    public static void main( String[] args ) {
        // GUI部品の取り扱いはmainスレッドではなく
        // awtスレッドで行わねばなりません．そのため，
        // 本当は下記のプログラムは正しくありません．
        // ですが，スレッドや無名クラスについて
        // 勉強する前に簡単に理解できるように，これを
        // 示しています．通常，問題なく動きます．
        //
        // (1) ウィンドウを一つ作って表示します
        FrameA frame1 = new FrameA();
        frame1.setTitle( "ソフトウェア工学実習: FrameA" );
        frame1.setVisible( true );
        // 
        // (2) もう一つウィンドウを作って表示します
        // FrameA frame2 = new FrameA();
        // frame2.setTitle( "ソフトウェア工学実習: FrameA(その2)" );
        // frame2.setVisible( true );
        // 
        // (3) 二つ目のウィンドウを操作します．
        // frame2.setLocation( 20, 30 );
        // frame2.setSize( 500, 500 );
    }
    // ===================================================
}
// =======================================================
