// =======================================================
// ソフトウェア工学実習 iijima@ae.keio.ac.jp
// =======================================================
package p0102;
// =======================================================
import javax.swing.*;
import java.awt.*;
// =======================================================
/**
 * ソフトウェア工学実習
 * @author iijima@ae.keio.ac.jp
 */
// =======================================================
public class LabelFrameA extends JFrame {
    // ===================================================
    /** ラベル */
    // ===================================================
	private JLabel aLabel;
    // ===================================================
    /**
     * コンストラクタ(インスタンス生成時の初期設定をします)
     */
    // ===================================================	
    public LabelFrameA() {
        // ラベルを作って，ウィンドウに貼り付けます
        aLabel = new JLabel( "こんにちは" );
        add( aLabel );
        // 
        // 終了方法の設定
        // (ウィンドウのクローズにアプリケーションを終了させる)
        setDefaultCloseOperation( JFrame.EXIT_ON_CLOSE );
        // GUI部品に適したウィンドウサイズに調整
        pack(); 
        // 位置と大きさの設定
        setBounds( 100, 200, 400, 300 );
    }
    // ===================================================
    /**
     * メイン・メソッド
     * @param args コマンド行引数
     */
    // ===================================================
    public static void main( String[] args ) {
        // GUI部品の取り扱いはmainスレッドではなく
        // awtスレッドで行わねばなりません．そのため，
        // 本当は下記のプログラムは正しくありません．
        // ですが，スレッドや無名クラスについて
        // 勉強する前に簡単に理解できるように，これを
        // 示しています．通常，問題なく動きます．
        //
        // (1) ラベル付きのウィンドウを一つ作って表示します
        LabelFrameA frame1 = new LabelFrameA();
        frame1.setTitle( "ソフトウェア工学実習: LabelFrameA" );
        frame1.setVisible( true );
    }
    // ===================================================
}
// =======================================================
